##[第一章](https://github.com/kymjs/KotlinDoc-cn#第一章)
---

###编码风格(Coding Conventions)
本页介绍当前kotlin语言编码风格。

####命名风格
如果有争议，则默认以Java编码风格为准，例如：
>>>使用驼峰法命名(避免使用下划线命名)  
>>>类型(包括Java中的基本数据类型)使用大写开头  
>>>方法和成员变量(属性)以小写字母开头  
>>>使用4个空格缩进
>>>公有方法(public functions)应该有文档注释
kotlin语言不具有主键概念(primary concept)，应该避免给成员变量(属性)使用前缀，例如"_"或"m_"或其他类型的标记，如果你需要保持一个field备份，使用$前缀，例如：`$foo`，千万不要创建一个私有变量还给命名为`_foo`  

####冒号
对于冒号之前的空格，在分隔子父类或接口的时候，或在分隔实例和类型的时候应该有一个空格，其他地方不应该有空格。    
```kotlin
interface Foo<out T : Any> : Bar { 
	fun foo(a: Int): T
}
```

####代码单元(Unit)
如果函数返回值是一个代码单元，则应该忽略返回类型，例如   
```kotlin
fun foo() { // 这里的": Unit"是应该被省略掉的
}
```
